In [1]:
import pandas as pd
import numpy as np

Pandas is a open source library built on top of numpy
It excels in performance and productivity.
It can work with data from a wide variety of sources.

1.Series
2.Data frames
3.Missing data
4.GroupBy
5.Merging,joining and concatenating
6.Operations
7.Data I/P and O/P

# SERIES

In [2]:
label=['a','b','c']
my_data=['10','20','30']
arr=np.array(my_data)
d = {'a':10,'b':20,'c':30}

In [3]:
pd.Series(data=my_data)

0    10
1    20
2    30
dtype: object

In [4]:
pd.Series(my_data,label)

a    10
b    20
c    30
dtype: object

In [5]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [6]:
pd.Series(data=label)

0    a
1    b
2    c
dtype: object

In [7]:
series1=pd.Series([1,2,3,4,5],['USA',"ENGLAND","USSR","JAPAN","AUSTRIA"])
series1

USA        1
ENGLAND    2
USSR       3
JAPAN      4
AUSTRIA    5
dtype: int64

In [8]:
series2=pd.Series([1,3,5,7],["INDIA","ENGLAND","BRAZIL","MEXICO"])
series2

INDIA      1
ENGLAND    3
BRAZIL     5
MEXICO     7
dtype: int64

In [9]:
series1['USA']    ##When we pass a index value it shows it's o/p weather it is string or an integer

1

In [10]:
series1 + series2  ## It compare the indexes if they r relavent it shows the value or it shows as NaN value

AUSTRIA    NaN
BRAZIL     NaN
ENGLAND    5.0
INDIA      NaN
JAPAN      NaN
MEXICO     NaN
USA        NaN
USSR       NaN
dtype: float64

## Dataframes

Dataframes is the most important concept in pandas and it is workhorse of the pandas

Datafrmaes building off the serious object data frames.

In [11]:
from numpy.random import randn

In [12]:
import numpy as np
np.random.seed(102)

In [13]:
df=pd.DataFrame(randn(5,4),['a','b','c','d','e'],['w','x','y','z'])

In [14]:
df   ## dataframe is a bunch of series share the same index

          w         x         y         z
a  1.668068  0.925862  1.057997 -0.920339
b  1.299748  0.331183 -0.509845 -0.903099
c -0.130016 -2.238203  0.973165 -0.024185
d -0.484928 -1.109264 -0.558975  1.042387
e -1.712263  0.136120 -0.464444  0.050980

In [15]:
df['w']

a    1.668068
b    1.299748
c   -0.130016
d   -0.484928
e   -1.712263
Name: w, dtype: float64

In [16]:
type(df["w"])

pandas.core.series.Series

In [17]:
## multiple col
df[['w','z']]

          w         z
a  1.668068 -0.920339
b  1.299748 -0.903099
c -0.130016 -0.024185
d -0.484928  1.042387
e -1.712263  0.050980

In [18]:
## Creating a new column
df['new'] = df["w"] + df["y"]

In [19]:
df

          w         x         y         z       new
a  1.668068  0.925862  1.057997 -0.920339  2.726065
b  1.299748  0.331183 -0.509845 -0.903099  0.789903
c -0.130016 -2.238203  0.973165 -0.024185  0.843149
d -0.484928 -1.109264 -0.558975  1.042387 -1.043903
e -1.712263  0.136120 -0.464444  0.050980 -2.176707

In [20]:
## If we want to drop a column
df.drop('new',axis=1)

          w         x         y         z
a  1.668068  0.925862  1.057997 -0.920339
b  1.299748  0.331183 -0.509845 -0.903099
c -0.130016 -2.238203  0.973165 -0.024185
d -0.484928 -1.109264 -0.558975  1.042387
e -1.712263  0.136120 -0.464444  0.050980

In [21]:
df

          w         x         y         z       new
a  1.668068  0.925862  1.057997 -0.920339  2.726065
b  1.299748  0.331183 -0.509845 -0.903099  0.789903
c -0.130016 -2.238203  0.973165 -0.024185  0.843149
d -0.484928 -1.109264 -0.558975  1.042387 -1.043903
e -1.712263  0.136120 -0.464444  0.050980 -2.176707

If we see actual df the column dosn't drop from the data frame ..if we want to drop permenantly we use 'inplace="True"method.

In [22]:
## We can drop the rows as well
df.drop('e',axis=0)

          w         x         y         z       new
a  1.668068  0.925862  1.057997 -0.920339  2.726065
b  1.299748  0.331183 -0.509845 -0.903099  0.789903
c -0.130016 -2.238203  0.973165 -0.024185  0.843149
d -0.484928 -1.109264 -0.558975  1.042387 -1.043903

In [23]:
df

          w         x         y         z       new
a  1.668068  0.925862  1.057997 -0.920339  2.726065
b  1.299748  0.331183 -0.509845 -0.903099  0.789903
c -0.130016 -2.238203  0.973165 -0.024185  0.843149
d -0.484928 -1.109264 -0.558975  1.042387 -1.043903
e -1.712263  0.136120 -0.464444  0.050980 -2.176707

In [24]:
## checking the rows
df.loc["a"]

w      1.668068
x      0.925862
y      1.057997
z     -0.920339
new    2.726065
Name: a, dtype: float64

In [25]:
##also other method selecting the rows
df.iloc[0]

w      1.668068
x      0.925862
y      1.057997
z     -0.920339
new    2.726065
Name: a, dtype: float64

In [26]:


df.loc["b","y"]

-0.5098449678999922

In [27]:
## We can select the subset 
df.loc[["a","c"],["x","z"]]

          x         z
a  0.925862 -0.920339
c -2.238203 -0.024185

In [28]:
df > 0 ## it will get a data from back of boolean values where it returns true if the dataframe value ot that point was > 0 and False when >! 0

       w      x      y      z    new
a   True   True   True  False   True
b   True   True  False  False   True
c  False  False   True  False   True
d  False  False  False   True  False
e  False   True  False   True  False

In [29]:
df["w"] > 0

a     True
b     True
c    False
d    False
e    False
Name: w, dtype: bool

In [30]:
df[(df["z"]<0) & (df["y"]>1)]   ## Multiple condition selection

          w         x         y         z       new
a  1.668068  0.925862  1.057997 -0.920339  2.726065

In [31]:
newind = "cd od qw we in".split()

In [32]:
df["state"] = newind

In [33]:
df

          w         x         y         z       new state
a  1.668068  0.925862  1.057997 -0.920339  2.726065    cd
b  1.299748  0.331183 -0.509845 -0.903099  0.789903    od
c -0.130016 -2.238203  0.973165 -0.024185  0.843149    qw
d -0.484928 -1.109264 -0.558975  1.042387 -1.043903    we
e -1.712263  0.136120 -0.464444  0.050980 -2.176707    in

In [34]:
df.set_index("state")

              w         x         y         z       new
state
cd     1.668068  0.925862  1.057997 -0.920339  2.726065
od     1.299748  0.331183 -0.509845 -0.903099  0.789903
qw    -0.130016 -2.238203  0.973165 -0.024185  0.843149
we    -0.484928 -1.109264 -0.558975  1.042387 -1.043903
in    -1.712263  0.136120 -0.464444  0.050980 -2.176707

In [35]:
## Index levels

import pandas as pd
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [36]:
df = pd.DataFrame(randn(6,2),hier_index,['A','B'])
df

             A         B
G1 1  1.447899  0.593138
   2 -0.755616 -0.627166
   3  0.884035  0.162718
G2 1 -2.502813  0.410791
   2  0.728750  0.029140
   3 -0.291052  0.314293

In [37]:
df.loc['G1']

          A         B
1  1.447899  0.593138
2 -0.755616 -0.627166
3  0.884035  0.162718

In [38]:
df.loc["G1"].loc[1]

A    1.447899
B    0.593138
Name: 1, dtype: float64

In [39]:
df.index.names = ["Groups",'Numbers']      ## multi_level indexing
df

                       A         B
Groups Numbers
G1     1        1.447899  0.593138
       2       -0.755616 -0.627166
       3        0.884035  0.162718
G2     1       -2.502813  0.410791
       2        0.728750  0.029140
       3       -0.291052  0.314293

In [40]:
## Cross section
df.xs(1,level="Numbers")

               A         B
Groups
G1      1.447899  0.593138
G2     -2.502813  0.410791

## Missing Data

In [41]:
d  = {"A":[1,2,3,np.nan],"B":[5,6,np.nan,np.nan],"C":[4,8,67,89]}
df = pd.DataFrame(d)
df

     A    B   C
0  1.0  5.0   4
1  2.0  6.0   8
2  3.0  NaN  67
3  NaN  NaN  89

In [42]:
df.dropna(axis=1)  ##Action done on column

    C
0   4
1   8
2  67
3  89

In [43]:
df.dropna()  ## on rows

     A    B  C
0  1.0  5.0  4
1  2.0  6.0  8

In [44]:
df.dropna(thresh=2)  ## It means shows the non NaN values in row wise data having atleast 2(non-NaN) Numbers

     A    B   C
0  1.0  5.0   4
1  2.0  6.0   8
2  3.0  NaN  67

In [45]:
##Replace missing values by usinf fillna()
df.fillna(value="fill value")

            A           B   C
0           1           5   4
1           2           6   8
2           3  fill value  67
3  fill value  fill value  89

In [46]:
df["A"].fillna(value=df["A"].mean())

0    1.0
1    2.0
2    3.0
3    2.0
Name: A, dtype: float64

## Groupby

Groupby allows you to group together rows based off a column and perform an aggregate function on them.

In [47]:
data = {"Company":["Google","Gooogle","Finolex","Finolex","KFC","KFC","BMW","BMW"],
       "Person":["Sherley","Jhon","Vaneesa","Candy","Sarah","Amy","Taylor","Trumph"],
       "Sales":[220,996,452,453,125,369,879,563]}

In [48]:
df = pd.DataFrame(data)
df

   Company   Person  Sales
0   Google  Sherley    220
1  Gooogle     Jhon    996
2  Finolex  Vaneesa    452
3  Finolex    Candy    453
4      KFC    Sarah    125
5      KFC      Amy    369
6      BMW   Taylor    879
7      BMW   Trumph    563

In [49]:
comp = df.groupby("Company")

In [50]:
comp.mean()

         Sales
Company
BMW      721.0
Finolex  452.5
Google   220.0
Gooogle  996.0
KFC      247.0

In [51]:
df.groupby("Company").sum().loc["KFC"]    ## We can do all the aggregate operations similarly

Sales    494
Name: KFC, dtype: int64

In [52]:
df.groupby("Company").describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
BMW       2.0  721.0  223.445743  563.0  642.00  721.0  800.00  879.0
Finolex   2.0  452.5    0.707107  452.0  452.25  452.5  452.75  453.0
Google    1.0  220.0         NaN  220.0  220.00  220.0  220.00  220.0
Gooogle   1.0  996.0         NaN  996.0  996.00  996.0  996.00  996.0
KFC       2.0  247.0  172.534055  125.0  186.00  247.0  308.00  369.0

## Merging,Joining and Concatenating

In [53]:
df1 = pd.DataFrame({"A":['A0','A1','A2','A3','A4'],
                   'B':['B0','B1','B2','B3','B4'],
                   'C':['C0','C1','C2','C3','C4'],
                   'D':['D0','D1','D2','D3','D4']},
                   index=[0,1,2,3,4,])
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3
4  A4  B4  C4  D4

In [54]:
df2 = pd.DataFrame({'A':['A5','A6','A7','A8'],
                   'B':['B5','B6','B7','B8'],
                   'C':['C5','C6','C7','C8'],
                   'D':['D5','D6','D7','D8']},
                  index=[5,6,7,8])
df2

    A   B   C   D
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7
8  A8  B8  C8  D8

In [55]:
df3 =pd.DataFrame({'A':['A9','A10','A11','A12'],
                   'B':['B9','B10','B11','B12'],
                   'C':['C9','C10','C11','C12'],
                   'D':['D9','D10','D11','D12']},
                 index=[9,10,11,12])
df3

      A    B    C    D
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11
12  A12  B12  C12  D12

Concatenation basically glues together dataframes.Keep in mind that directions should match along the axis you are concatenating on.You can use 'pd.concat' and pass in a list of Dataframes to concatenate together:

In [56]:
pd.concat([df1,df2,df3])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11
12  A12  B12  C12  D12

In [57]:
pd.concat([df1,df2,df3],axis=1)

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4    A4   B4   C4   D4  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN   A8   B8   C8   D8  NaN  NaN  NaN  NaN
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11
12  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A12  B12  C12  D12

The Merge function allows you to merge DataFrames together using a similar logic as merging SQL tables together

In [58]:
left = pd.DataFrame({"key1":["K0",'K1','K0','K1'],
       "Key2":["K0","K0","K1","K1"],
       "A":['A0','A1','A2','A3'],
       "B":['B0','B1','B2','B3']})



right = pd.DataFrame({"key1":["K0",'K1','K2','K3'],
                      "Key2":["K0","K0","K0","K0"],
                      "C":['C0','C1','C2','C3'],
                      "D":['D0','D1','D2','D3']})

In [ ]:
pd.merge(left,right,how='outer',on=['key1','key2'])

## Operations

In [60]:
df = pd.DataFrame({'col1':[1,2,3,4],
                  'col2':[444,567,890,444],
                  'col3':['abc','def','ghi','jkl']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   567  def
2     3   890  ghi
3     4   444  jkl

In [63]:
## Finding unique values
df["col2"].unique()

array([444, 567, 890], dtype=int64)

In [64]:
## Each value reapeated in the dataframe
df["col2"].value_counts()

444    2
567    1
890    1
Name: col2, dtype: int64

In [67]:
## Conditional stmts
df[df["col2"]>2]

   col1  col2 col3
0     1   444  abc
1     2   567  def
2     3   890  ghi
3     4   444  jkl

In [69]:
df[(df["col1"]>2) & (df["col2"] == 444)]

   col1  col2 col3
3     4   444  jkl

In [70]:
##Apply method
def times2(x):
    return x*2

In [71]:
df["col1"].apply(times2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [73]:
## Sorting the values
df.sort_values("col2")

   col1  col2 col3
0     1   444  abc
3     4   444  jkl
1     2   567  def
2     3   890  ghi

In [75]:
## Pivot table
data = {"A":['foo','foo','foo','bar','bar','bar'],
       'B':["one","one","one","two","two","two"],
       "C":["x",'y','x','y','x','y'],
       "D":[1,2,4,5,7,1]}
df = pd.DataFrame(data)

In [76]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  2
2  foo  one  x  4
3  bar  two  y  5
4  bar  two  x  7
5  bar  two  y  1

In [79]:
df.pivot_table(values="D",index=["A","B"],columns=["C"])

C          x    y
A   B
bar two  7.0  3.0
foo one  2.5  2.0